
Mobile IP Working Group                                 David B. Johnson
INTERNET-DRAFT                                Carnegie Mellon University
                                                         Charles Perkins
                                                         IBM Corporation
                                                        26 November 1996


                        Mobility Support in IPv6

                   <draft-ietf-mobileip-ipv6-02.txt>


Abstract

   This document specifies the operation of mobile computers using IPv6.
   Each mobile node is always identified by its home address, regardless
   of its current point of attachment to the Internet.  While situated
   away from its home, a mobile node is also associated with a care-of
   address, which provides information about the mobile node's current
   location.  IPv6 packets addressed to a mobile node's home address are
   transparently routed to its care-of address.  The protocol enables
   IPv6 nodes to cache the binding of a mobile node's home address with
   its care-of address, and to then send packets destined for the mobile
   node directly to it at this care-of address.


Status of This Memo

   This document is a submission by the Mobile IP Working Group of the
   Internet Engineering Task Force (IETF).  Comments should be submitted
   to the Working Group mailing list at "mobile-ip@SmallWorks.COM".
   Distribution of this memo is unlimited.

   This document is an Internet-Draft.  Internet-Drafts are working
   documents of the Internet Engineering Task Force (IETF), its areas,
   and its working groups.  Note that other groups may also distribute
   working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at
   any time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   To learn the current status of any Internet-Draft, please check
   the "1id-abstracts.txt" listing contained in the Internet-Drafts
   Shadow Directories on ftp.is.co.za (Africa), nic.nordu.net (Europe),
   munnari.oz.au (Pacific Rim), ds.internic.net (US East Coast), or
   ftp.isi.edu (US West Coast).






Johnson and Perkins             Expires 26 May 1997             [Page i]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996




                                Contents



Abstract                                                               i

Status of This Memo                                                    i

 1. Introduction                                                       1

 2. Terminology                                                        2
     2.1. General Terms . . . . . . . . . . . . . . . . . . . . . .    2
     2.2. Mobile IPv6 Terms . . . . . . . . . . . . . . . . . . . .    3
     2.3. Specification Language  . . . . . . . . . . . . . . . . .    4

 3. Overview of Mobile IPv6 Operation                                  6

 4. New IPv6 Destination Options                                      11
     4.1. Binding Update Option . . . . . . . . . . . . . . . . . .   11
     4.2. Binding Acknowledgement Option  . . . . . . . . . . . . .   14
     4.3. Binding Request Option  . . . . . . . . . . . . . . . . .   17

 5. Requirements for IPv6 Nodes                                       18

 6. Correspondent Node Operation                                      20
     6.1. Receiving Binding Updates . . . . . . . . . . . . . . . .   20
     6.2. Requests to Cache a Binding . . . . . . . . . . . . . . .   21
     6.3. Requests to Delete a Binding  . . . . . . . . . . . . . .   21
     6.4. Sending Binding Acknowledgements  . . . . . . . . . . . .   21
     6.5. Cache Replacement Policy  . . . . . . . . . . . . . . . .   22
     6.6. Receiving ICMP Error Messages . . . . . . . . . . . . . .   23
     6.7. Sending Packets to a Mobile Node  . . . . . . . . . . . .   24

 7. Home Agent Operation                                              26
     7.1. Primary Care-of Address Registration  . . . . . . . . . .   26
     7.2. Primary Care-of Address De-registration . . . . . . . . .   28
     7.3. Tunneling Intercepted Packets to a Mobile Node  . . . . .   28
     7.4. Renumbering the Home Subnet . . . . . . . . . . . . . . .   29

 8. Mobile Node Operation                                             31
     8.1. Movement Detection  . . . . . . . . . . . . . . . . . . .   31
     8.2. Forming New Care-of Addresses . . . . . . . . . . . . . .   33
     8.3. Sending Binding Updates to the Home Agent . . . . . . . .   34
     8.4. Sending Binding Updates to Correspondent Nodes  . . . . .   35
     8.5. Sending Binding Updates to the Previous Default Router  .   37
     8.6. Retransmitting Binding Updates  . . . . . . . . . . . . .   37



Johnson and Perkins            Expires 26 May 1997             [Page ii]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


     8.7. Rate Limiting for Sending Binding Updates . . . . . . . .   38
     8.8. Receiving Binding Acknowledgements  . . . . . . . . . . .   38
     8.9. Using Multiple Care-of Addresses  . . . . . . . . . . . .   39
    8.10. Returning Home  . . . . . . . . . . . . . . . . . . . . .   39

 9. Routing Multicast Packets                                         41

10. Constants                                                         42

11. Security Considerations                                           43

Acknowledgements                                                      44

 A. Open Issues                                                       45
     A.1. Session Keys with Local Routers . . . . . . . . . . . . .   45
     A.2. Source Address Filtering by Firewalls . . . . . . . . . .   45
     A.3. Dynamic Home Agent Address Discovery  . . . . . . . . . .   46
     A.4. Replay Protection for Binding Updates . . . . . . . . . .   46

References                                                            47

Chair's Address                                                       49

Authors' Addresses                                                    50



























Johnson and Perkins            Expires 26 May 1997            [Page iii]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


1. Introduction

   This document specifies the operation of mobile computers using
   Internet Protocol Version 6 (IPv6) [5].  Without specific support for
   mobility in IPv6, packets destined to a mobile node (host or router)
   would not be able to reach it while the mobile node is away from its
   home IPv6 subnet, since routing is based on the network prefix in a
   packet's destination IP address.  In order continue communication
   in spite of its movement, a mobile node could change its IP address
   each time it moves to a new IPv6 subnet, but the mobile node would
   then not be able to maintain transport and higher-layer connections
   when it changes location.  Mobility support in IPv6 is particularly
   important, as mobile computers are likely to account for a majority
   or at least a substantial fraction of the population of the Internet
   during the lifetime of IPv6.

   The protocol operation defined here, known as Mobile IPv6, allows a
   mobile node to move from one IPv6 subnet to another without changing
   the mobile node's IP address.  A mobile node is always addressable
   by its "home address", the IP address assigned to the mobile node
   within its home IPv6 subnet.  Packets may be routed to it using this
   address regardless of the mobile node's current point of attachment
   to the Internet, and the mobile node may continue to communicate with
   other nodes (stationary or mobile) after moving to a new subnet.
   The movement of a mobile node away from its home subnet is thus
   transparent to transport and higher-layer protocols and applications.

   The Mobile IPv6 protocol is just as suitable for mobility across
   homogeneous media as for mobility across heterogeneous media.  For
   example, Mobile IPv6 facilitates node movement from one Ethernet
   segment to another as well as it accommodates node movement from an
   Ethernet segment to a wireless LAN cell, as long as the mobile node's
   IP address remains unchanged after such a movement.

   One can think of the Mobile IPv6 protocol as solving the "macro"
   mobility management problem.  More "micro" mobility management
   applications -- for example, handoff amongst wireless transceivers,
   each of which covers only a very small geographic area, are possibly
   more suited to other solutions.  For example, as long as node
   movement does not occur between link-level points of attachment on
   different IPv6 subnets, link-layer mobility support offered by a
   number of current wireless LAN products is likely to offer faster
   convergence and lower overhead than Mobile IPv6.  Extensions to the
   Mobile IPv6 protocol are also possible to support a more local,
   hierarchical form of handoff, but such extensions are beyond the sope
   of this document.





Johnson and Perkins             Expires 26 May 1997             [Page 1]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


2. Terminology

2.1. General Terms

      IP

         Internet Protocol Version 6 (IPv6).

      node

         A device that implements IP.

      router

         A node that forwards IP packets not explicitly addressed to
         itself.

      host

         Any node that is not a router.

      link

         A communication facility or medium over which nodes can
         communicate at the link layer, such as an Ethernet (simple or
         bridged).  A link is the layer immediately below IP.

      interface

         A node's attachment to a link.

      network prefix

         A bit string that consists of some number of initial bits of an
         IP address.

      link-layer address

         A link-layer identifier for an interface, such as IEEE 802
         addresses on Ethernet links.

      packet

         An IP header plus payload.







Johnson and Perkins             Expires 26 May 1997             [Page 2]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


2.2. Mobile IPv6 Terms

      home address

         An IP address assigned to a mobile node within its home subnet.
         The network prefix in a mobile node's home address is equal to
         the network prefix of the home subnet.

      home subnet

         The IP subnet indicated by a mobile node's home address.
         Standard IP routing mechanisms will deliver packets destined
         for a mobile node's home address to its home subnet.

      mobile node

         A node that can change its link-level point of attachment from
         one IP subnet to another, while still being addressable via its
         home address.

      movement

         A change in a mobile node's point of attachment to the Internet
         such that it is no longer link-level connected to the same IP
         subnet as it was previously.  If a mobile node is not currently
         link-level connected to its home subnet, the mobile node is
         said to be "away from home".

      correspondent node

         A peer with which a mobile node is communicating.  The
         correspondent node may be either mobile or stationary.

      foreign subnet

         Any IP subnet other than the mobile node's home subnet.

      home agent

         A router on a mobile node's home subnet with which the mobile
         node has registered its current care-of address.  While the
         mobile node is away from home, the home agent intercepts
         packets on the home subnet destined to the mobile node's home
         address, encapsulates them, and tunnels them to the mobile
         node's registered care-of address.






Johnson and Perkins             Expires 26 May 1997             [Page 3]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


      care-of address

         An IP address associated with a mobile node while visiting
         a foreign subnet, which uses the network prefix of that
         foreign subnet.  Among the multiple care-of addresses that a
         mobile node may have at a time (e.g., with different network
         prefixes), the one registered with its home agent is called its
         "primary" care-of address.

      binding

         The association of the home address of a mobile node with a
         care-of address for that mobile node, along with the remaining
         lifetime of that association.


2.3. Specification Language

   In this document, several words are used to signify the requirements
   of the specification.  These words are often capitalized.

      MUST

         This word, or the adjective "REQUIRED", means that the
         definition is an absolute requirement of the specification.

      MUST NOT

         This phrase means that the definition is an absolute
         prohibition of the specification.

      SHOULD

         This word, or the adjective "RECOMMENDED", means that there may
         exist valid reasons in particular circumstances to ignore a
         particular item, but the full implications must be understood
         and carefully weighed before choosing a different course.

      SHOULD NOT

         This phrase means that there may exist valid reasons in
         particular circumstances when the particular behavior is
         acceptable or even useful, but the full implications should be
         understood and the case carefully weighed before implementing
         any behavior described with this label.






Johnson and Perkins             Expires 26 May 1997             [Page 4]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


      MAY

         This word, or the adjective "OPTIONAL", means that an item
         is truly optional.  For example, one vendor may choose to
         include the item because a particular marketplace requires
         it or because the vendor feels that it enhances the product,
         while another vendor may omit the same item.  An implementation
         which does not include a particular option MUST be prepared to
         interoperate with another implementation which does include the
         option.

      silently discard

         The implementation discards the packet without further
         processing, and without indicating an error to the sender.  The
         implementation SHOULD provide the capability of logging the
         error, including the contents of the discarded packet, and
         SHOULD record the event in a statistics counter.

































Johnson and Perkins             Expires 26 May 1997             [Page 5]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


3. Overview of Mobile IPv6 Operation

   A mobile node is always addressable by its home address, whether it
   is currently attached to its home subnet or is away from home.  While
   a mobile node is at home, packets addressed to the mobile node's
   home address are routed to it using conventional Internet routing
   mechanisms in the same way as if the node were never mobile.  Since
   the network prefix of a mobile node's home address is equal to the
   network prefix of its home subnet, packets addressed to it will be
   routed to its home subnet.

   While a mobile node is attached to some foreign subnet away from
   home, it is also addressable by one or more care-of addresses, in
   addition to its home address.  A care-of address is an IP address
   associated with a mobile node only while visiting a particular
   foreign subnet.  The network prefix of a care-of address being used
   by a mobile node is equal to the network prefix of the foreign
   subnet to which the mobile node is link-level connected, and thus
   packets addressed to this care-of address will be routed to the
   mobile node's location away from home.  The association between
   a mobile node's home address and care-of address is known as a
   "binding" for the mobile node.  A mobile node typically acquires its
   care-of address through stateless [14] or stateful (e.g., DHCPv6 [3])
   address autoconfiguration, according to the methods of IPv6 Neighbor
   Discovery [8], although other methods of acquiring a care-of address
   are also possible.

   While away from home, the mobile node registers one of its binding
   with a router in its home subnet, requesting this router to function
   as the "home agent" for the mobile node.  The care-of address in this
   binding registered with its home agent is known as the mobile node's
   "primary care-of address".  The mobile node's home agent thereafter
   uses proxy Neighbor Discovery to intercept any IPv6 packets addressed
   to the mobile node's home address on the home subnet, and tunnels
   each intercepted packet to the mobile node's primary care-of address.
   To tunnel each intercepted packet, the home agent encapsulates the
   packet using IPv6 encapsulation [4], addressed to the mobile node's
   primary care-of address.

   Mobile IPv6 provides a mechanism for IPv6 nodes communicating with
   a mobile node, to dynamically learn and cache the mobile node's
   binding.  When sending a packet to any IPv6 destination, a node
   checks its cached bindings for an entry for the packet's destination
   address.  If a cached binding for this destination address is
   found, the node uses an IPv6 Routing header [5] (instead of IPv6
   encapsulation) to route the packet to the mobile node through the
   care-of address indicated in this binding.  If, instead, the sending
   node has no cached binding for this destination address, the node



Johnson and Perkins             Expires 26 May 1997             [Page 6]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   sends the packet normally (with no Routing header), and the packet
   is subsequently intercepted and tunneled by the mobile node's home
   agent as described above.  A node communicating with a mobile node is
   referred to in this document as a "correspondent node" of the mobile
   node.

   A mobile node's home agent and correspondent nodes learn and
   cache the mobile node's binding through use of a set of new IPv6
   destination options [5] defined for Mobile IPv6.  Since an IPv6
   Destination Options header containing one or more destination options
   can appear in any IPv6 packet, any Mobile IPv6 option can be sent in
   either of two ways:

    -  A Mobile IPv6 option can be included within any IPv6 packet
       carrying any payload such as TCP [11] or UDP [10].

    -  A Mobile IPv6 option can be sent as a separate IPv6 packet
       containing no payload.  In this case, the Next Header field
       in the Destination Options header is set to the value 59, to
       indicate "No Next Header" [5].

   The following three new IPv6 destination options are defined for
   Mobile IPv6:

      Binding Update

         A Binding Update is used by a mobile node to notify a
         correspondent node or its home agent of its current binding.
         The Binding Update sent to the mobile node's home agent is
         marked as a "home registration".  Any packet that includes a
         Binding Update option MUST also include an IPv6 Authentication
         header [1].  The Binding Update option is described in detail
         in Section 4.1.

      Binding Acknowledgement

         A Binding Acknowledgement is used to acknowledge receipt of
         a Binding Update, if an acknowledgement was requested in the
         Binding Update.  Other Binding Updates MAY be acknowledged
         but need not be.  Any packet that includes a Binding
         Acknowledgement option MUST also include an IPv6 Authentication
         header [1].  The Binding Acknowledgement option is described in
         detail in Section 4.2.

      Binding Request

         A Binding Request is used to request a mobile node to send a
         Binding Update to this node, containing its current binding.



Johnson and Perkins             Expires 26 May 1997             [Page 7]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


         This option is typically used by a correspondent node to
         refresh a cached binding for a mobile node, when the lifetime
         on this cached binding is close to expiration.  The Binding
         Request option is described in detail in Section 4.3.

   Extensions to the format of these options may be included after the
   fixed portion of the option data specified in this document.  The
   presence of such extensions will be indicated by the Option Length
   field within the option.  When the Option Length is greater than the
   length required for the option specified here, the remaining octets
   are interpreted as extensions.  Currently, no extensions have been
   defined.

   This document describes the Mobile IPv6 protocol in terms of the
   following two conceptual data structures used in the maintenance of
   cached bindings:

      Binding Cache

         A cache, maintained by each IPv6 node, of bindings for other
         nodes.  An entry in a node's binding cache for which the node
         is serving as a home agent is marked as a "home registration"
         entry and SHOULD NOT be deleted by the home agent until the
         expiration of its binding lifetime, whereas other Binding Cache
         entries MAY be replaced at any time by any reasonable local
         cache replacement policy.  The Binding Cache MAY be implemented
         in any manner consistent with the external behavior described
         in this document, for example by being combined with the node's
         Destination Cache as maintained through Neighbor Discovery [8].

      Binding Update List

         A list, maintained by each mobile node, recording information
         for each Binding Update sent by this mobile node, for which
         the Lifetime of the binding sent in that Update has not yet
         expired.  For each such Binding Update, the Binding Update List
         records the IP address of the node to which the Update was
         sent, the home address for which the Update was sent, and the
         remaining lifetime of the binding.  The Binding Update List
         MAY be implemented in any manner consistent with the external
         behavior described in this document.

   When a mobile node configures a new care-of address and decides to
   use this new address as its primary care-of address, the mobile
   node registers this new binding with its home agent by sending
   the home agent a Binding Update.  The mobile node indicates
   that an acknowledgement is needed for this Binding Update and
   continues to periodically retransmit it until acknowledged.  The



Johnson and Perkins             Expires 26 May 1997             [Page 8]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   home agent acknowledges the Binding Update by returning a Binding
   Acknowledgement to the mobile node.

   When a mobile node receives a packet tunneled to it from its
   home agent, the mobile node assumes that the original sending
   correspondent node has no binding cache entry for the mobile node,
   since the correspondent node would otherwise have sent the packet
   directly to the mobile node using a Routing header.  The mobile node
   thus returns a Binding Update to the correspondent node, allowing
   it to cache the mobile node's binding for routing future packets.
   Although the mobile node may request an acknowledgement for this
   Binding Update, it need not, since subsequent packets from the
   correspondent node will continue to be intercepted and tunneled by
   the mobile node's home agent, effectively causing any needed Binding
   Update retransmission.

   A correspondent node with a binding cache entry for a mobile node
   may refresh this binding, for example if the binding's lifetime
   is near expiration, by sending a Binding Request to the mobile
   node.  Normally, a correspondent node will only refresh a binding
   cache entry in this way if it is actively communicating with the
   mobile node and has indications, such as an open TCP connection to
   the mobile node, that it will continue this communication in the
   future.  When a mobile node receives a Binding Request, it replies by
   returning a Binding Update to the node sending the Binding Request.

   A mobile node may use more than one care-of address at the same time,
   although only one care-of address may be registered for it at its
   home agent as its primary care-of address.  The mobile node's home
   agent will tunnel all intercepted packets for the mobile node to its
   registered primary care-of address, but the mobile node will accept
   packets that it receives at any of its current care-of addresses.
   Use of more than one care-of address by a mobile node may be useful,
   for example, to improve smooth handoff when the mobile node moves
   from one wireless IP subnet to another.  If each wireless subnet is
   connected to the Internet through a separate base station, such that
   the wireless transmission range from the two base stations overlap,
   the mobile node may be able to remain link-level connected within
   both subnets while in the area of overlap.  In this case, the mobile
   node could acquire a new care-of address in the new subnet before
   moving out of transmission range and link-level disconnecting from
   the old subnet.  The mobile node may thus still accept packets at
   its old care-of address while it works to update its home agent and
   correspondent nodes, notifying them of its new care-of address.

   Since correspondent nodes cache bindings, it is expected that
   correspondent nodes usually will route packets directly to the mobile
   node's care-of address, so that the home agent is rarely involved



Johnson and Perkins             Expires 26 May 1997             [Page 9]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   with packet transmission to the mobile node.  This is essential for
   scalability and reliability, and for minimizing overall network load.
   By caching the care-of address of a mobile node, optimal routing of
   packets can be achieved from the correspondent node to the mobile
   node.  Routing packets directly to the mobile node's care-of address
   also eliminates congestion at the mobile node's home agent and home
   subnet.  In addition, the impact of of any possible failure of the
   home agent, the home subnet, or intervening networks leading to the
   home subnet is reduced, since these nodes and links are not involved
   in the delivery of most packets to the mobile node.









































Johnson and Perkins            Expires 26 May 1997             [Page 10]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


4. New IPv6 Destination Options

4.1. Binding Update Option

   The Binding Update destination option is used by a mobile node to
   notify a correspondent node or its home agent of a new care-of
   address.

   The Binding Update option is encoded in type-length-value (TLV)
   format as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
                                   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                   |  Option Type  | Option Length |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |A|H|L|       Reserved          |            Lifetime           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                         Identification                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                                                               +
   |                                                               |
   +                        Care-of Address                        +
   |                                                               |
   +                                                               +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                                                               +
   |                                                               |
   +                    Home Link-Local Address                    +
   |                  (only present if L bit set)                  |
   +                                                               +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Option Type

         192 ???

      Option Length

         8-bit unsigned integer.  Length of the option, in octets,
         excluding the Option Type and Option Length fields.  For the
         current definition of the Binding Update option, this field
         MUST be set to 24 if the Home Link-Local Address Present (L)
         bit is not set, and MUST otherwise be set to 40.



Johnson and Perkins            Expires 26 May 1997             [Page 11]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


      Acknowledge (A)

         The Acknowledge (A) bit is set by the sending node to request a
         Binding Acknowledgement (Section 4.2) be returned upon receipt
         of the Binding Update option.

      Home Registration (H)

         The Home Registration (H) bit is set by the sending node to
         request the receiving node to act as this node's home agent.
         The Destination Address in the IP header of the packet carrying
         this option MUST be that of a router sharing the same network
         prefix as the home address of the mobile node in the binding.

      Home Link-Local Address Present (L)

         The Home Link-Local Address Present (L) bit indicates the
         presence of the Home Link-Local Address field in the Binding
         Update.  This bit is set by the sending node to request
         the receiving node to act as a proxy (for participating in
         the Neighbor Discovery Protocol) for the node while it is
         away from home.  This bit MUST NOT be set unless the Home
         Registration (H) bit is also set in the Binding Update.

      Reserved

         Sent as 0; ignored on reception.

      Lifetime

         16-bit unsigned integer.  The number of seconds remaining
         before the binding must be considered expired.  A value of all
         ones (0xffff) indicates infinity.  A value of zero indicates
         that the Binding Cache entry for the mobile node should be
         deleted.

      Identification

         a 32-bit number used by the receiving node to sequence Binding
         Updates, and by the sending node to match a returned Binding
         Acknowledgement message with this Binding Update.

      Care-of Address

         The care-of address of the mobile node for this binding.  When
         set equal to the home address of the mobile node, the Binding
         Update option instead indicates that any existing binding for




Johnson and Perkins            Expires 26 May 1997             [Page 12]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


         the mobile node should be deleted; no binding for the mobile
         node should be created in this case.

      Home Link-Local Address

         The link-local address of the mobile node used by the mobile
         node when it was last attached to its home subnet.  This field
         in the Binding Update is optional and is only present when the
         Home Link-Local Address (L) bit is set.

   The home address of the mobile node in the binding is indicated by
   the Source Address field in the IP header of the packet containing
   the Binding Update option.

   Any packet that includes a Binding Update option MUST include an IPv6
   Authentication header [1] in order to protect against forged Binding
   Updates.

   The three highest-order bits of the Option Type are encoded to
   indicate specific processing of the option [5].  For the Binding
   Update option, these three bits are set to 110, indicating that the
   data within the option cannot change en-route to the packet's final
   destination, and that any IPv6 node processing this option that does
   not recognize the Option Type must discard the packet and, only if
   the packet's Destination Address was not a multicast address, return
   an ICMP Parameter Problem, Code 2, message to the packet's Source
   Address.

   Extensions to the Binding Update option format may be included after
   the fixed portion of the Binding Update option specified above.  The
   presence of such extensions will be indicated by the Option Length
   field.  When the Option Length is greater than 24 octets if the Home
   Link-Local Address (L) bit is not set, or greater than 40 octets if
   the Home Link-Local Address (L) bit is set, the remaining octets
   are interpreted as extensions.  Currently, no extensions have been
   defined.















Johnson and Perkins            Expires 26 May 1997             [Page 13]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


4.2. Binding Acknowledgement Option

   The Binding Acknowledgement destination option is used to acknowledge
   receipt of a Binding Update option (Section 4.1).  When a node
   receives a Binding Update addressed to itself, in which the
   Acknowledge (A) bit set, it MUST return a Binding Acknowledgement.

   The Binding Acknowledgement option is encoded in type-length-value
   (TLV) format as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
                   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                   |  Option Type  | Option Length |    Status     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Refresh            |            Lifetime           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                         Identification                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Option Type

         193 ???

      Option Length

         8-bit unsigned integer.  Length of the option, in octets,
         excluding the Option Type and Option Length fields.  For the
         current definition of the Binding Acknowledgement option, this
         field MUST be set to 8.

      Status

         8-bit unsigned integer indicating the disposition of the
         Binding Update.  Values of the Status field less than 128
         indicate that the Binding Update was accepted by the receiving
         node.  The following such Status values are currently defined:

              0   Binding Update accepted

         Values of the Status field greater than or equal to 128
         indicate that the Binding Update was rejected by the receiving
         node.  The following such Status values are currently defined:

            128   Reason unspecified
            129   Poorly formed Binding Update
            130   Administratively prohibited
            131   Insufficient resources



Johnson and Perkins            Expires 26 May 1997             [Page 14]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


            132   Home registration not supported
            133   Not home subnet
            134   Identification field mismatch
            135   Unknown home agent address

         Up-to-date values of the Status field are to be specified in
         the most recent "Assigned Numbers" [12].

      Refresh

         The recommended period at which the mobile node should send
         a new Binding Update to this node in order to "refresh" the
         mobile node's binding in this node's binding cache, in case
         the node fails and loses its cache state.  The Refresh period
         is determined by the node sending the Binging Acknowledgement
         (the node caching the binding).  If this node is serving as the
         mobile node's home agent, the Refresh value may be set, for
         example, based on whether the node stores the mobile node's
         binding in volatile storage or in nonvolatile storage.  If the
         node sending the Binding Acknowledgement is not serving as the
         mobile node's home agent, the Refresh period SHOULD be set
         equal to the Lifetime period in the Binding Acknowledgement;
         even if this node loses this cache entry due to a failure of
         the node, packets from it can still reach the mobile node
         through the mobile node's home agent, causing a new Binding
         Update to this node to allow it to recreate this cache entry.

      Lifetime

         The granted lifetime for which this node will attempt to retain
         the entry for this mobile node in its binding cache.  If the
         node sending the Binding Acknowledgement is serving as the
         mobile node's home agent, the Lifetime period also indicates
         the period for which this node will continue this service; if
         the mobile node requires home agent service from this node
         beyond this period, the mobile node MUST send a new Binding
         Update to it before the expiration of this period to extend the
         lifetime.

      Identification

         The acknowledgement Identification is copied from the Binding
         Update option, for use by the mobile node in matching the
         acknowledgement with an outstanding Binding Update.

   Any packet that includes a Binding Acknowledgement option MUST
   include an IPv6 Authentication header [1] in order to protect against
   forged Binding Acknowledgements.



Johnson and Perkins            Expires 26 May 1997             [Page 15]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   If the node returning the Binding Acknowledgement accepted the
   Binding Update for which the Acknowledgement is being returned (the
   value of the Status field in the Acknowledgement is less than 128),
   this node will have an entry for the mobile node in its Binding
   Cache, and MUST use this entry (which includes the care-of address
   received in the Binding Update) in sending the packet containing the
   Binding Acknowledgement to the mobile node.  The details of sending
   this packet to the mobile node are the same as for sending any packet
   to a mobile node using a Binding Cache entry, and are described in
   Section 6.7.  The packet is sent using a Routing header, routing the
   packet to the mobile node through its care-of address recorded in the
   Binding Cache entry.

   If the node returning the Binding Acknowledgement instead
   rejected the Binding Update (the value of the Status field in the
   Acknowledgement is greater than or equal to 128), this node MUST
   similarly use a Routing header in sending the packet containing the
   Binding Acknowledgement, as described in Section 6.7, but MUST NOT
   use its Binding Cache in forming the IP header or Routing header
   in this packet.  Rather, the care-of address used by this node in
   sending the packet containing the Binding Acknowledgement MUST be
   copied from the care-of address received in the rejected Binding
   Update; this node MUST NOT modify its Binding Cache in response
   to receiving this rejected Binding Update and MUST ignore its
   Binding Cache in sending the packet in which it returns this Binding
   Acknowledgement.  The packet is sent using a Routing header, routing
   the packet to the Source Address of the rejected Binding Update
   through the care-of address indicated in the Binding Update.

   The three highest-order bits of the Option Type are encoded to
   indicate specific processing of the option [5].  For the Binding
   Acknowledgement option, these three bits are set to 110, indicating
   that the data within the option cannot change en-route to the
   packet's final destination, and that any IPv6 node processing this
   option that does not recognize the Option Type must discard the
   packet and, only if the packet's Destination Address was not a
   multicast address, return an ICMP Parameter Problem, Code 2, message
   to the packet's Source Address.

   Extensions to the Binding Acknowledgement option format may be
   included after the fixed portion of the Binding Acknowledgement
   option specified above.  The presence of such extensions will be
   indicated by the Option Length field.  When the Option Length is
   greater than 8 octets, the remaining octets are interpreted as
   extensions.  Currently, no extensions have been defined.






Johnson and Perkins            Expires 26 May 1997             [Page 16]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


4.3. Binding Request Option

   The Binding Request destination option is used to request a mobile
   node's binding from the mobile node.  When a mobile node receives
   a packet containing a Binding Request option, it SHOULD return a
   Binding Update (Section 4.1) to that node.

   The Binding Request option is encoded in type-length-value (TLV)
   format as follows:

    0                   1
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Option Type  | Option Length |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Option Type

         194 ???

      Option Length

         8-bit unsigned integer.  Length of the option, in octets,
         excluding the Option Type and Option Length fields.  For the
         current definition of the Binding Acknowledgement option, this
         field MUST be set to 0.

   The three highest-order bits of the Option Type are encoded to
   indicate specific processing of the option [5].  For the Binding
   Request option, these three bits are set to 110, indicating that the
   data within the option cannot change en-route to the packet's final
   destination, and that any IPv6 node processing this option that does
   not recognize the Option Type must discard the packet and, only if
   the packet's Destination Address was not a multicast address, return
   an ICMP Parameter Problem, Code 2, message to the packet's Source
   Address.

   Extensions to the Binding Request option format may be included after
   the fixed portion of the Binding Request option specified above.
   The presence of such extensions will be indicated by the Option
   Length field.  When the Option Length is greater than 0 octets,
   the remaining octets are interpreted as extensions.  Currently, no
   extensions have been defined.








Johnson and Perkins            Expires 26 May 1997             [Page 17]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


5. Requirements for IPv6 Nodes

   Mobile IPv6 places some special requirements on the functions
   provided by different IPv6 nodes.  This section summarizes those
   requirements, identifying the functionality each requirement is
   intended to support.  Further details on this functionality is
   provided in the following sections.

   Since any IPv6 node may at any time be a correspondent node of a
   mobile node, the following requirements pertain to all IPv6 nodes:

    -  Every IPv6 node SHOULD be able to process a received Binding
       Update option, and to return a Binding Acknowledgement message if
       requested.

    -  Every IPv6 node SHOULD be able to maintain a Binding Cache of the
       bindings received in accepted Binding Updates.

   In order for a mobile node to operate correctly while away from
   home, at least one IPv6 router in the mobile node's home subnet must
   function as a home agent for the mobile node.  The following special
   requirements pertain to all IPv6 routers capable of serving as a home
   agent:

    -  Every home agent MUST be able to maintain a registry of mobile
       node bindings, recording each mobile node's primary care-of
       address, for those mobile nodes for which it is serving as the
       home agent.

    -  Every home agent MUST be able to intercept packets (using proxy
       Neighbor Discovery) on the local subnet addressed to a mobile
       node for which it is currently serving as the home agent while
       that mobile node is away from home.

    -  Every home agent MUST be able to encapsulate such intercepted
       packets in order to tunnel them to the primary care-of address
       for the mobile node indicated in its binding.

    -  Every home agent MUST be able to return Binding Acknowledgements
       in response to Binding Updates received from a mobile node.











Johnson and Perkins            Expires 26 May 1997             [Page 18]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   Finally, the following requirements pertain all IPv6 nodes capable of
   functioning as mobile nodes:

    -  Every IPv6 mobile node MUST be able to perform IPv6
       decapsulation [4].

    -  Every IPv6 mobile node MUST support sending Binding Updates, as
       specified in Sections 8.3, 8.4, and 8.5; and MUST be able to
       receive and process Binding Acknowledgements, as specified in
       Section 8.8.

    -  Every IPv6 mobile node MUST maintain a Binding Update List in
       which it records the IP address of each other node to which it
       has sent a Binding Update, for which the Lifetime sent in that
       binding has not yet expired.




































Johnson and Perkins            Expires 26 May 1997             [Page 19]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


6. Correspondent Node Operation

   A correspondent node is any node communicating with a mobile node.
   The correspondent node, itself, may be fixed or mobile, and may
   possibly also be functioning as a home agent for Mobile IPv6.  The
   procedures in this section thus apply to all IPv6 nodes.


6.1. Receiving Binding Updates

   Upon receiving a Binding Update option in some packet, the receiving
   node MUST validate the packet according to the following tests:

    -  The packet contains an IP Authentication header and the
       authentication is valid [1].  The Authentication header is
       assumed to provide both authentication and integrity protection.

    -  The Option Length field in the option is greater than or equal to
       24 octets if the Home Link-Local Address (L) bit is not set, or
       greater or equal to 40 octets if the Home Link-Local Address (L)
       bit is set.

    -  The Identification field is valid.

   Any Binding Update not satisfying all of these tests MUST be silently
   ignored, although the remainder of the packet (i.e., other options,
   extension headers, or payload) SHOULD be processed normally according
   to any procedure defined for that part of the packet.

   If the Binding Update is valid according to the tests above, then the
   Binding Update is processed further as follows:

    -  If the Lifetime specified in the Binding Update is nonzero and
       the specified Care-of Address is not equal to the Source Address
       in the IP header of the packet carrying the Binding Update,
       then this is a request to cache a binding for the mobile node
       (the home address of the mobile node is specified by the Source
       Address field in the packet's IP header).  Processing for this
       type of received Binding Update is described in Section 6.2.

    -  If the Lifetime specified in the Binding Update is zero or the
       specified Care-of Address matches the Source Address field in the
       IP header of the packet carrying the Binding Update, then this is
       a request to delete the mobile node's binding (as above, the home
       address of the mobile node is specified by the Source Address
       field in the packet's IP header).  Processing for this type of
       received Binding Update is described in Section 6.3.




Johnson and Perkins            Expires 26 May 1997             [Page 20]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


6.2. Requests to Cache a Binding

   If a node receives a valid Binding Update requesting it to cache a
   binding for a mobile node, as specified in Section 6.1, then the node
   MUST examine the Home Registration (H) bit in the Binding Update
   to determine how to further process the Binding Update.  If the
   Home Registration (H) bit is set, the Binding Update is processed
   according to the procedure specified in Section 7.1.

   If the Home Registration (H) bit is not set, then the receiving node
   SHOULD create a new entry in its Binding Cache for this mobile node
   (or update its existing Binding Cache entry for this mobile node, if
   such an entry already exists).  The home address of the mobile node
   is taken from the Source Address field in the packet's IP header.
   The new Binding Cache entry records the association between this
   address and the Care-of Address specified in the Binding Update.
   The node must also begin a timer to delete this Binding Cache entry
   after the expiration of the Lifetime period specified in the Binding
   Update.


6.3. Requests to Delete a Binding

   If a node receives a valid Binding Update requesting it to delete
   a binding for a mobile node, as specified in Section 6.1, then the
   node MUST examine the Home Registration (H) bit in the Binding Update
   to determine how to further process the Binding Update.  If the
   Home Registration (H) bit is set, the Binding Update is processed
   according to the procedure specified in Section 7.2.

   If the Home Registration (H) bit is not set, then the receiving node
   MUST delete any existing entry in its Binding Cache for this mobile
   node.  The home address of the mobile node is taken from the Source
   Address field in the packet's IP header.


6.4. Sending Binding Acknowledgements

   When any node receives a packet containing a Binding Update option
   in which the Acknowledge (A) bit is set, it SHOULD return a Binding
   Acknowledgement message acknowledging receipt of the Binding
   Update.  If the node accepts the Binding Update and adds the binding
   contained in it to its Binding Cache, the Status field in the
   Binding Acknowledgement MUST be set to a value less than 128; if
   the node rejects the Binding Update and does not add the binding
   contained in it to its Binding Cache, the Status field in the Binding
   Acknowledgement MUST be set to a value greater than or equal to 128.




Johnson and Perkins            Expires 26 May 1997             [Page 21]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   Specific values for the Status field are described in Section 4.2 and
   in the most recent "Assigned Numbers" [12].

   As described in Section 4.2, the packet in which the Binding
   Acknowledgement is returned MUST include an IPv6 Authentication
   header [1] in order to protect against forged Binding
   Acknowledgements, and the packet MUST be sent using a Routing
   header through the care-of address contained in the Binding Update
   being acknowledged.  This ensures that the Binding Acknowledgement
   will be routed to the current location of the node sending the
   Binding Update, whether the Binding Update was accepted or rejected.


6.5. Cache Replacement Policy

   Any entry in a node's Binding Cache MUST be deleted after the
   expiration of the Lifetime specified in the Binding Update from which
   the entry was created or was last updated.  Conceptually, a node
   maintains a separate timer for each entry in its Binding Cache.  When
   creating or updating a Binding Cache entry in response to a received
   and accepted Binding Update, the node sets the timer for this entry
   to the specified Lifetime period.  When a Binding Cache entry's timer
   expires, the node deletes the entry.

   Each node's Binding Cache will, by necessity, have a finite size.
   A node MAY use any reasonable local policy for managing the space
   within its Binding Cache, except that any entry marked as a "home
   registration" (Section 7.1) MUST NOT be deleted from the cache until
   the expiration of its lifetime period.  When attempting to add a new
   "home registration" entry in response to a Binding Update with the
   Home Registration (H) bit set, if insufficient space exists (or can
   be reclaimed) in the node's Binding Cache, the node MUST reject the
   Binding Update and SHOULD return a Binding Acknowledgement message
   to the sending mobile node, in which the Status field is set to 131
   (Insufficient resources).  When otherwise attempting to add a new
   entry to its Binding Cache, a node MAY, if needed, choose to drop any
   entry already in its Binding Cache, other than a "home registration"
   entry, in order to make space for the new entry.  For example, a
   "least-recently used" (LRU) strategy for cache entry replacement is
   likely to work well.

   If a packet is sent by a node to a destination for which it has
   dropped the cache entry from its Binding Cache, the packet will be
   routed normally, leading to the mobile node's home subnet.  There,
   the packet will be intercepted by the mobile node's home agent and
   tunneled to the mobile node's current primary care-of address.  As
   when a Binding Cache entry is initially created, this indirect
   routing to the mobile node through its home agent will result in the



Johnson and Perkins            Expires 26 May 1997             [Page 22]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   mobile node sending a Binding Update to this sending node, allowing
   this node to add an entry again for this destination to its Binding
   Cache.


6.6. Receiving ICMP Error Messages

   When a correspondent node sends a packet to a mobile node, if the
   correspondent node has a Binding Cache entry for the destination
   mobile node's address (its home address), then the correspondent
   node uses a Routing header to deliver the packet to the mobile node
   through the care-of address recorded in the Binding Cache entry.  Any
   ICMP error message caused by the packet on its way to the mobile node
   will be returned normally to the correspondent node.

   On the other hand, if the correspondent node has no Binding Cache
   entry for the mobile node, the packet will be routed to the mobile
   node's home subnet, where it will be intercepted by the mobile node's
   home agent, encapsulated, and tunneled to the mobile node's care-of
   address.  Any ICMP error message caused by the packet on its way to
   the mobile node while in the tunnel, will be returned to the mobile
   node's home agent (the source of the tunnel) By the definition of
   IPv6 encapsulation [4], this encapsulating node MUST relay certain
   ICMP error messages back to the original sender of the packet, which
   in this case is the correspondent node.

   Likewise, if a packet for a mobile node arrives at the mobile node's
   previous default router (e.g., the mobile node moved after the packet
   was sent), the router will encapsulate and tunnel the packet to the
   mobile node's new care-of address (if it has a Binding Cache entry
   for the mobile node).  As above, any ICMP error message caused by the
   packet while in this tunnel will be returned to the previous default
   router (the source of the tunnel), which MUST relay certain ICMP
   error messages back to the correspondent node [4].

   Thus, in all cases, any meaningful ICMP error messages caused by
   packets from a correspondent node to a mobile node will be returned
   to the correspondent node.  If the correspondent node receives
   persistent ICMP Host Unreachable or Network Unreachable error
   messages after sending packets to a mobile node based on an entry in
   its Binding Cache, the correspondent node SHOULD delete this Binding
   Cache entry.  If the correspondent node subsequently transmits
   another packet to the mobile node, the packet will be routed to the
   mobile node's home subnet, intercepted by the mobile node's home
   agent, and tunneled to the mobile node's care-of address using IPv6
   encapsulation.  The mobile node will then return a Binding Update to
   the correspondent node, allowing it to recreate a (correct) Binding
   Cache entry for the mobile node.



Johnson and Perkins            Expires 26 May 1997             [Page 23]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


6.7. Sending Packets to a Mobile Node

   Before sending any packet, the sending node SHOULD examine its
   Binding Cache for an entry for the destination address to which the
   packet is being sent.  If the sending node has a Binding Cache entry
   for this address, the sending node SHOULD use a Routing header to
   route the packet to this mobile node (the destination node) through
   the care-of address recorded in that Binding Cache entry.  For
   example, assuming use of a Type 0 Routing header [5], if no other use
   of a Routing header is involved in the routing of this packet, the
   mobile node sets the following fields in the packet's IP header and
   Routing header as indicated below:

    -  The Destination Address in the packet's IP header is set to the
       mobile node's care-of address copied from the Binding Cache
       entry.

    -  The Routing header is initialized to contain a single route
       segment, with an Address of the mobile node's home address (the
       original destination address to which the packet was being sent).

   Following the definition of a Type 0 Routing header [5], this packet
   will routed to the mobile node's care-of address, where it will be
   delivered to the mobile node (the mobile node has associated the
   care-of address with its network interface).  Normal processing of
   the Routing header by the mobile node will then proceed as follows:

    -  The mobile node swaps the Destination Address in the packet's IP
       header and the Address specified in the Routing header.  This
       results in the packet's IP Destination Address being set to the
       mobile node's home address.

    -  The mobile node then resubmits the packet to its IPv6 module for
       further processing.  Since the mobile node recognizes its own
       home address as one if its current IP addresses, the packet is
       processed further within the mobile node, in the same way then as
       if the mobile node was at home.

   If, instead, the sending node has no Binding Cache entry for the
   destination address to which the packet is being sent, the sending
   node simply sends the packet normally, with no Routing header.  If
   the destination node is not a mobile node (or is a mobile node that
   is currently at home), the packet will be delivered directly to this
   node and processed normally by it.  If, however, the destination node
   is a mobile node that is currently away from home, the packet will
   be intercepted by the mobile node's home agent and tunneled (using
   IPv6 encapsulation [4]) to the mobile node's current primary care-of
   address, as described in Section 7.3.  The mobile node will then send



Johnson and Perkins            Expires 26 May 1997             [Page 24]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   a Binding Update to the sending node, as described in Section 8.4,
   allowing the sending node to create a Binding Cache entry for its use
   in sending subsequent packets to this mobile node.
















































Johnson and Perkins            Expires 26 May 1997             [Page 25]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


7. Home Agent Operation

7.1. Primary Care-of Address Registration

   General processing of a received Binding Update that requests a
   binding to be cached, is described in Section 6.2.  However, if the
   Home Registration (H) bit is set in the Binding Update, then the
   receiving node MUST process the Binding Update as specified in this
   section, rather than following the general procedure specified in
   Section 6.2.

   To begin processing the Binding Update, the home agent MUST perform
   the following sequence of tests:

    -  If the node is not a router that implements home agent
       functionality, then the node MUST reject the Binding Update and
       SHOULD return a Binding Acknowledgement message to the mobile
       node, in which the Status field is set to 132 (Home registration
       not supported).

    -  Else, if the home address for the binding in the Binding Update
       (the Source Address in the packet's IP header) is not an on-link
       IPv6 address with respect to the home agent's current Prefix
       List, then the home agent MUST reject the Binding Update and
       SHOULD return a Binding Acknowledgement message to the mobile
       node, in which the Status field is set to 133 (Not home subnet).

    -  Else, if the home agent chooses to reject the Binding Update for
       any other reason (e.g., insufficient resources to serve another
       mobile node as a home agent), then the home agent SHOULD return
       a Binding Acknowledgement message to the mobile node, in which
       the Status field is set to an appropriate value to indicate the
       reason for the rejection.

   If the home agent does not reject the Binding Update as described
   above, then it becomes the home agent for the mobile node.  The new
   home agent (the receiving node) MUST then create a new entry or
   update the existing entry in its Binding Cache for this mobile node's
   home address, as described in Section 6.2.  In addition, the home
   agent MUST mark this Binding Cache entry as a "home registration"
   to indicate that the node is serving as a home agent for this
   binding.  Binding Cache entries marked as a "home registration" MUST
   be excluded from the normal cache replacement policy used for the
   Binding Cache (Section 6.5) and MUST NOT be removed from the Binding
   Cache until the expiration of the Lifetime period.

   If the home agent was not already serving as a home agent for this
   mobile node (the home agent did not already have a Binding Cache



Johnson and Perkins            Expires 26 May 1997             [Page 26]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   entry for this address marked as a "home registration"), then the
   home agent MUST multicast onto the home subnet (to the all-nodes
   multicast address) a Neighbor Advertisement message [8] on behalf
   of the mobile node, to advertise the home agent's own link-layer
   address for the mobile node's home IP address.  The Target Address in
   the Neighbor Advertisement message MUST be set to the mobile node's
   home address, and the Advertisement MUST include a Target Link-layer
   Address option specifying the home agent's link-layer address.  The
   Solicited Flag (S) in the Advertisement MUST NOT be set, since it was
   not solicited by any Neighbor Solicitation message.  The Override
   Flag (O) in the Advertisement MUST be set, indicating that the
   Advertisement SHOULD override any existing Neighbor Cache entry at
   any node receiving it.

   Any node on the home subnet receiving this Neighbor Advertisement
   message will thus update its Neighbor Cache to associate the mobile
   node's home address with the home agent's link layer address, causing
   it to transmit future packets for the mobile node instead to the
   mobile node's home agent.  Since multicasts on the local link (such
   as Ethernet) are typically not guaranteed to be reliable, the home
   agent MAY retransmit this Neighbor Advertisement message up to
   MAX_ADVERT_REXMIT times to increase its reliability.  It is still
   possible that some nodes on the home subnet will not receive any of
   these Neighbor Advertisements, but these nodes will eventually be
   able to detect the link-layer address change for the mobile node's
   home address, through use of Neighbor Unreachability Detection [8].

   In addition, while this node is serving as a home agent to this
   mobile node (it still has a "home registration" entry for this mobile
   node in its Binding Cache), it MUST act as a proxy for this mobile
   node to reply to any received Neighbor Solicitation messages for it.
   When a home agent receives a Neighbor Solicitation message, it MUST
   check if the Target Address specified in the message matches the home
   address of any mobile node for which it has a Binding Cache entry
   marked as a "home registration".  If such an entry exists in its
   Binding Cache, the home agent MUST reply to the Neighbor Solicitation
   message with a Neighbor Advertisement message, giving the home
   agent's own link-layer address as the link-layer address for the
   specified Target Address.  Likewise, if the mobile node included its
   home link-local address and set the Home Link-Local Address (L) bit
   in its Binding Update with which it registered with its home agent,
   its home agent MUST also similarly act as a proxy for the mobile
   node's home link-local address while it has a "home registration"
   entry in its Binding Cache for the mobile node.  Acting as a proxy
   in this way allows other nodes on the mobile node's home subnet to
   resolve the mobile node's IPv6 home address and IPv6 link-local
   address, and allows the home agent to to defend these addresses on
   the home subnet for Duplicate Address Detection [8].



Johnson and Perkins            Expires 26 May 1997             [Page 27]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


7.2. Primary Care-of Address De-registration

   General processing of a received Binding Update that requests a
   binding to be deleted, is described in Section 6.3.  However, if the
   Home Registration (H) bit is set in the Binding Update, then the
   receiving node MUST process the Binding Update as specified in this
   section, rather than following the general procedure specified in
   Section 6.3.

   To begin processing the Binding Update, the home agent MUST perform
   the following sequence of tests:

    -  If the node is not a router that implements home agent
       functionality, then the node MUST reject the Binding Update and
       SHOULD return a Binding Acknowledgement message to the mobile
       node, in which the Status field is set to 132 (Home registration
       not supported).

    -  Else, if the home address for the binding in the Binding Update
       (the Source Address in the packet's IP header) is not an on-link
       IPv6 address with respect to the home agent's current Prefix
       List, then it MUST reject the Binding Update and SHOULD return a
       Binding Acknowledgement message to the mobile node, in which the
       Status field is set to 133 (Not home subnet).

   If the home agent does not reject the Binding Update as described
   above, then it MUST delete any existing entry in its Binding Cache
   for this mobile node.

   In addition, the home agent MUST multicast a Neighbor Advertisement
   message (to the all-nodes multicast address), giving the mobile
   node's home address as the Target Address, and specifying the mobile
   node's link-layer address in a Target Link-layer Address option in
   the Neighbor Advertisement message.  The home agent MAY retransmit
   this Neighbor Advertisement message up to MAX_ADVERT_REXMIT times
   to increase its reliability; any nodes on the home subnet that miss
   all of these Neighbor Advertisements can also eventually detect the
   link-layer address change for the mobile node's home address, through
   use of Neighbor Unreachability Detection [8].


7.3. Tunneling Intercepted Packets to a Mobile Node

   For any packet sent to a mobile node from the mobile node's home
   agent, for which the home agent is the original sender of the packet,
   the home agent is operating as a correspondent node of the mobile
   node for this packet and the procedures described in Section 6.7
   apply.  The home agent uses a Routing header to route the packet



Johnson and Perkins            Expires 26 May 1997             [Page 28]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   to the mobile node through the care-of address in the home agent's
   Binding Cache (the mobile node's primary care-of address, in this
   case).

   In addition, while the mobile node is away from home and this node
   is acting as the mobile node's home agent, the home agent intercepts
   any packets on the home subnet addressed to the mobile node's
   home address, as described in Section 7.1.  The home agent cannot
   use a Routing header to forward these intercepted packets to the
   mobile node, since it cannot modify the packet in flight without
   invalidating any existing IPv6 Authentication header present in the
   packet [1].

   For forwarding each intercepted packet to the mobile node, the
   home agent MUST tunnel the packet to the mobile node using IPv6
   encapsulation [4]; the tunnel entry point node is the home agent,
   and the tunnel exit point node is the mobile node itself (using its
   primary care-of address as registered with the home agent).  When a
   home agent encapsulates an intercepted packet for forwarding to the
   mobile node, the home agent sets the Source Address in the prepended
   tunnel IP header to its own IP address, and sets the Destination
   Address in the tunnel IP header to the mobile node's primary care-of
   address.  When received by the mobile node (using its primary care-of
   address), normal processing of the tunnel header [4] will result in
   decapsulation and processing of the original packet by the mobile
   node.


7.4. Renumbering the Home Subnet

   Neighbor Discovery [8] specifies a mechanism by which all nodes on a
   subnet can gracefully autoconfigure new addresses, say by each node
   combining a new routing prefix with its existing link-layer address.
   As currently specified, this mechanism works when the nodes are on
   the same link as the router issuing the necessary multicast packets
   to advertise the new routing prefix(es) appropriate for the link.

   However, for mobile nodes away from home, special care must be taken
   to allow the mobile nodes to renumber gracefully.  The most direct
   method of ensuring this is for the home agent to encapsulate and
   tunnel the multicast packets to the primary care-of address of each
   mobile node for which it is serving as the home agent.  The rules for
   this are as follows:

    -  A mobile node assumes that its routing prefix has not changed
       unless it receives authenticated Router Advertisement messages
       from its home agent that the prefix has changed.




Johnson and Perkins            Expires 26 May 1997             [Page 29]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


    -  When the mobile node is at home, the home agent does not tunnel
       Router Advertisements to it.

    -  The mobile node's home agent serves as a proxy for the mobile
       node's home address and link-local address, including defending
       these addresses for Duplicate Address Detection, while the mobile
       node is registered with the home agent away from home.

    -  When a home subnet prefix changes, the home agent tunnels Router
       Advertisement packets to each mobile node which is currently
       away from home and using a home address with the affected
       routing prefix.  Such tunneled Router Advertisements MUST be
       authenticated [1].

    -  When a mobile node receives a tunneled Router Advertisement
       containing a new routing prefix, it must perform the standard
       autoconfiguration operation to create its new address

    -  When a mobile node returns to its home subnet, it must again
       perform Duplicate Address Detection at the earliest possible
       moment after it has registered with its home agent.

    -  A mobile node may send a Router Solicitation to its home agent at
       any time, within the constraints imposed by rate control in the
       Neighbor Discovery specification [8]


























Johnson and Perkins            Expires 26 May 1997             [Page 30]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


8. Mobile Node Operation

8.1. Movement Detection

   A mobile node MAY use any combination of mechanisms available to
   it to detect when its link-level point of attachment has moved
   from one IP subnet to another.  The primary movement detection
   mechanism for Mobile IPv6 defined here uses the facilities of
   IPv6 Neighbor Discovery, including Router Discovery and Neighbor
   Unreachability Detection.  The description here is based on the
   conceptual model of the organization and data structures defined by
   Neighbor Discovery [8].

   Mobile nodes SHOULD use Router Discovery to discover new routers and
   on-link network prefixes; a mobile node MAY send Router Solicitation
   messages, or MAY wait for unsolicited (periodic) Router Advertisement
   messages, as specified for Router Discovery [8].  Based on received
   Router Advertisement messages, a mobile node (in the same way as any
   other node) maintains an entry in its Default Router List for each
   router, and an entry in its Prefix List for each network prefix, that
   it currently considers to be on-link.  Each entry in these lists has
   an associated invalidation timer value (extracted from the Router
   Advertisement) used to expire the entry when it becomes invalid.

   While away from home, a mobile node SHOULD select one router from its
   Default Router List to use as its default router, and one network
   prefix advertised by that router from its Prefix List to use as
   the network prefix in its primary care-of address.  A mobile node
   MAY also have associated additional care-of addresses, using other
   network prefixes from its Prefix List.  The method by which a mobile
   node selects and forms a care-of address from the available network
   prefixes is described in Section 8.2.  The mobile node registers
   its primary care-of address with its home agent, as described in
   Section 8.3.

   While away from home and using some router as its default router,
   it is important for a mobile node to be able to quickly detect when
   that router becomes unreachable, so that it can switch to a new
   default router and to a new primary care-of address.  Since some
   links (notably wireless) do not necessarily work equally well in both
   directions, it is likewise important for the mobile node to detect
   when it becomes unreachable to its default router, so that the mobile
   node can take steps to ensure that any correspondent nodes attempting
   to communicate with the it can still reach it through some other
   route.

   To detect when its default router becomes unreachable, a mobile
   node SHOULD use Neighbor Unreachability Detection.  As specified in



Johnson and Perkins            Expires 26 May 1997             [Page 31]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   Neighbor Discovery [8], while the mobile node is actively sending
   packets to (or through) its default router, the mobile node can
   detect that the router is still reachable either through indications
   from upper layer protocols on the mobile node that a connection is
   making "forward progress" (e.g., receipt of TCP acknowledgements for
   new data transmitted), or through receipt of a Neighbor Advertisement
   message form its default router in response to an explicit Neighbor
   Solicitation messages to it.  Note that although this mechanism only
   detects that the mobile node's default router has become unreachable
   to the mobile node while the mobile node is actively sending packets
   to it, this is the only time that this direction of reachability
   confirmation is needed.  Confirmation that the mobile node is still
   reachable from the router is handled separately, as described below.

   For a mobile node to detect when it has become unreachable to its
   default router, however, the mobile node cannot efficiently rely on
   Neighbor Unreachability Detection alone, since the network overhead
   would be prohibitively high in many cases for a mobile node to
   continually probe its default router with Neighbor Solicitation
   messages even when it is not otherwise actively sending packets to
   it.  Instead, a mobile node SHOULD consider receipt of any IPv6
   packets from its current default router as an indication that it is
   still reachable from the router.  Both packets from the router's IP
   address and (IPv6) packets from its link-layer address (e.g., those
   forwarded but not originated by the router) SHOULD be considered.

   Since the router SHOULD be sending periodic multicast Router
   Advertisement messages, the mobile node will have frequent
   opportunity to check if it is still reachable to its default router,
   even in the absence of other packets to it from the router.  On some
   types of network interfaces, the mobile node MAY also supplement this
   by setting its network interface into "promiscuous" receive mode,
   so that it is able to receive all packets on the link, including
   those not link-level addressed to it.  The mobile node will then
   be able to detect any packets sent by the router, in order to to
   detect reachability from the router.  This may be useful on very low
   bandwidth (e.g., wireless) links, but its use MUST be configurable on
   the mobile node.

   If the above means do not provide indication that the mobile node
   is still reachable from its current default router (i.e., the
   mobile node receives no packets form the router for a period of
   time), then the mobile node SHOULD actively probe the router with
   Neighbor Solicitation messages, even if it is not otherwise actively
   sending packets to the router.  If it receives a solicited Neighbor
   Advertisement message in response from the router, then the mobile
   node can deduce that it is still reachable.  It is expected that the
   mobile node will in most cases be able to determine its reachability



Johnson and Perkins            Expires 26 May 1997             [Page 32]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   from the router by listening for packets from the router as described
   above, and thus, such extra Neighbor Solicitation probes should
   rarely be necessary.

   With some types of networks, it is possible that additional
   indications about link-layer mobility can be obtained from
   lower-layer protocol or device driver software within the mobile
   node.  However, a mobile node MUST NOT assume that all link-layer
   mobility indications from lower layers indicate a movement of the
   mobile node's link-layer connection to a new IP subnet, such that the
   mobile node would need to switch to a new default router and primary
   care-of address.  Upon lower-layer indication of link-layer mobility,
   the mobile node SHOULD send Router Solicitation messages to determine
   if new routers (and new on-link network prefixes) are present on its
   new link.

   Such lower-layer information might also be useful to a mobile node in
   deciding to switch its primary care-of address to one of the other
   care-of addresses it has formed from the on-link network prefixes
   currently available through different default routers from which the
   mobile node is reachable.  For example, a mobile node MAY use signal
   strength or signal quality information (with suitable hysteresis)
   for its link with the available default routers to decide when to
   switch to a new primary care-of address using that default router
   rather than its current default router (and current primary care-of
   address).  Even though the mobile node's current default router may
   still be reachable in terms of Neighbor Unreachability Detection, the
   mobile node MAY use such lower-layer information to determine that
   switching to a new default router would provide a better connection.


8.2. Forming New Care-of Addresses

   After detecting that its link-layer point of attachment has moved
   from one IPv6 subnet to another (i.e., its current default router
   has become unreachable and it has discovered a new default router),
   a mobile node SHOULD form a new primary care-of address using one of
   the on-link network prefixes advertised by the new router.  A mobile
   node MAY form a new primary care-of address at any time, except
   that it MUST NOT do so too frequently (not more often than once per
   MAX_UPDATE_RATE seconds).

   In addition, after discovering a new on-link network prefix, a
   mobile node MAY form a new (non-primary) care-of address using that
   network prefix, even when it has not switched to a new default
   router.  A mobile node can have only one primary care-of address
   at a time (registered with its home agent), but it MAY have an
   additional care-of address for each network prefix on its current



Johnson and Perkins            Expires 26 May 1997             [Page 33]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   link.  Furthermore, since a wireless network interface may actually
   allow a mobile node to be reachable on more than one link at a time
   (i.e., within wireless transmitter range of routers on more than one
   separate link), a mobile node MAY have care-of addresses on more than
   one link at a time.  The use of more than one care-of address at a
   time is described in Section 8.9.

   As described in Section 3, in order to form a new care-of address,
   a mobile node MAY use either stateless [14] or stateful (e.g.,
   DHCPv6 [3]) address autoconfiguration.  If a mobile node needs to
   send packets as part of the method of address autoconfiguration,
   it MUST use an IPv6 link-local address rather than its own IPv6
   home address as the Source Address in the IP header of each such
   autoconfiguration packet.

   In some cases, a mobile node may already know a (constant) IPv6
   address that has been assigned to it for its use only while visiting
   a specific foreign subnet.  For example, a mobile node may be
   statically configured with an IPv6 address assigned by the system
   administrator of some foreign subnet, for its use while visiting that
   subnet.  If so, rather than using address autoconfiguration to form
   a new care-of address using this network prefix, the mobile node
   SHOULD use its own pre-assigned address as its care-of address on
   this subnet.


8.3. Sending Binding Updates to the Home Agent

   After deciding to change its primary care-of address as described
   in Sections 8.1 and 8.2, a mobile node MUST register this care-of
   address with its home agent in order to make this its primary care-of
   address.  To do so, the mobile node sends a packet to its home agent
   containing a Binding Update option with the Home Registration (H)
   bit is set in the Binding Update.  The mobile node also sets the
   Acknowledge (A) bit in the Binding Update, requesting the home
   agent to return a Binding Acknowledgement message in response to
   this Binding Update.  As described in Section 4.2, the mobile node
   SHOULD retransmit this Binding Update to its home agent until it
   receives a matching Binding Acknowledgement message.  Once reaching a
   retransmission timeout period of MAX_BINDACK_TIMEOUT, the mobile node
   SHOULD continue to periodically retransmit the Binding Update at this
   rate until acknowledged (or until it begins attempting to register a
   different primary care-of address).








Johnson and Perkins            Expires 26 May 1997             [Page 34]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


8.4. Sending Binding Updates to Correspondent Nodes

   A mobile node MAY send a Binding Update to any correspondent node at
   any time (subject to the rate limiting defined in Section 8.7).  In
   any Binding Update sent by a mobile node, the Care-of Address field
   MUST be set to one of the care-of addresses currently in use by the
   mobile node or to the mobile node's home address.  If set to one of
   the mobile node's current care-of addresses (the care-of address
   given MAY differ from the mobile node's primary care-of address), the
   Binding Update requests the correspondent node to create or update
   a an entry for the mobile node in the correspondent node's Binding
   Cache to record this care-of address for use in sending future
   packets to the mobile node.  If, instead, the Care-of Address field
   is set to the mobile node's home address, the Binding Update requests
   the correspondent node to delete any existing Binding Cache entry
   that it has for the mobile node.  A mobile node MAY set the Care-of
   Address field differently for sending Binding Updates to different
   correspondent nodes.

   When sending any Binding Update, the mobile node MUST record in its
   Binding Update List the following fields from the Binding Update:

    -  The IP address of the node to which the Binding Update was sent.

    -  The home address for which the Binding Update was sent,

    -  The remaining lifetime of the binding, initialized from the
       Lifetime field of the Binding Update.

   The mobile node MUST retain in its Binding Update List information
   about all Binding Updates sent, for which the lifetime of the
   binding has not yet expired.  When sending a Binding Update, if an
   entry already exists in the mobile node's Binding Update List for
   an earlier Binding Update sent to that same destination node, the
   existing Binding Update List is updated to reflect the new Binding
   Update rather than creating a new Binding Update List entry.

   In general, when a mobile node sends a Binding Update to its home
   agent to register a new primary care-of address (as described in
   Section 8.3), the mobile node will also typically send a Binding
   Update to each correspondent node for which an entry exists in the
   mobile node's Binding Update List.  Thus, correspondent nodes are
   generally kept updated and can send almost all packets directly to
   the mobile node using the mobile node's current binding.

   The mobile node, however, need not send these Binding Updates
   immediately after configuring a new care-of address.  For example,
   since the Binding Update is a destination option and can be included



Johnson and Perkins            Expires 26 May 1997             [Page 35]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   in any packet sent by a mobile node, the mobile node MAY delay
   sending a new Binding Update to any correspondent node for a
   short period of time, in hopes that the needed Binding Update
   can be included in some packet that the mobile node sends to that
   correspondent node for some other reason (for example, as part of
   some TCP connection in use).  In this case, when sending a packet
   to some correspondent node, the mobile node SHOULD check in its
   Binding Update List to determine if a new Binding Update to this
   correspondent node is needed, and SHOULD include the new Binding
   Update in this packet as necessary.

   In addition, when a mobile node receives a packet for which the
   mobile node can deduce that the original sender of the packet has no
   Binding Cache entry for the mobile node, or for which the mobile node
   can deduce that the original sender of the packet has an out-of-date
   care-of address in its Binding Cache entry for the mobile node, the
   mobile node SHOULD return a Binding Update to the sender giving its
   current care-of address.  In particular, the mobile node SHOULD
   return a Binding Update in response to receiving a packet that meets
   all of the following tests:

    -  The packet was tunneled using IPv6 encapsulation.

    -  The Destination Address in the tunnel (outer) IP header is equal
       to any of the mobile node's care-of addresses.

    -  The Destination Address in the original (inner) IP header is
       equal to the mobile node's home address.  If the original packet
       contains a Routing header, the final Address indicated in the
       Routing header should be used in this comparison rather than the
       Destination Address in the original IP header.

    -  The Source Address in the tunnel (outer) IP header differs from
       the Source Address in the original (inner) IP header.

   The destination address to which the Binding Update should be sent in
   response to receiving a packet meeting all of the tests above, is the
   Source Address in the original (inner) IP header of the packet.

   Binding Updates sent to correspondent nodes are not generally
   required to be acknowledged.  However, if the mobile node wants to be
   sure that its new care-of address has been added to a correspondent
   node's Binding Cache, the mobile node MAY request an acknowledgement
   by setting the Acknowledge (A) bit in the Binding Update.  In this
   case, however, the mobile node SHOULD NOT continue to retransmit the
   Binding Update once the retransmission timeout period has reached
   MAX_BINDACK_TIMEOUT.




Johnson and Perkins            Expires 26 May 1997             [Page 36]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   A mobile node MAY choose to keep its location private from certain
   correspondent nodes, and thus need not send new Binding Updates to
   those correspondents.  A mobile node MAY also send a Binding Update
   to such a correspondent node to instruct it to delete any existing
   binding for the mobile node from its Binding Cache, as described in
   Section 4.1.  No other IPv6 nodes are authorized to send Binding
   Updates on behalf of a mobile node.


8.5. Sending Binding Updates to the Previous Default Router

   After switching to a new default router (and thus also changing
   its primary care-of address), a mobile node SHOULD send a Binding
   Update message to its previous default router, giving its new care-of
   address.  If the mobile node sends such a Binding Update, the Source
   Address in the packet carrying this Binding Update MUST be set the
   mobile node's old primary care-of address (that it used while using
   this default router), and the Care-of Address field MUST be set to
   the mobile node's new primary care-of address.  In addition, the Home
   Registration (H) bit MUST also be set in this Binding Update, to
   request the mobile node's previous default router to temporarily act
   as a home agent for the mobile node's old primary care-of address.
   Note that the previous router does not necessarily know the mobile
   node's home address as part of this sequence of events.

   If any subsequent packets arrive at this previous router for
   forwarding to the mobile node's old primary care-of address,
   the router SHOULD encapsulate each such packet (using IPv6
   encapsulation [4]) and tunnel it to the mobile node at its new
   primary care-of address.  Moreover, for the lifetime of the "home
   registration" Binding Cache entry at this router, this router MUST
   act as a proxy for the mobile node's previous care-of address,
   for purposes of participation in Neighbor Discovery [8], in the
   same way as any home agent does for a mobile node's home address
   (Section 7.1).  This allows the router to intercept packets addressed
   to the mobile node's previous care-of address, and to encapsulate and
   tunnel them to the mobile node's new care-of address, as described in
   Section 7.3.


8.6. Retransmitting Binding Updates

   If, after sending a Binding Update in which the Acknowledge (A)
   bit is set, a mobile node fails to receive an acceptable Binding
   Acknowledgement within INITIAL_BINDACK_TIMEOUT seconds, the
   mobile node SHOULD retransmit the Binding Update until a Binding
   Acknowledgement is received.  Such a retransmitted Binding
   Update MUST use he same Identification value as the original



Johnson and Perkins            Expires 26 May 1997             [Page 37]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   transmission.  The retransmissions by the mobile node MUST use
   an exponential back-off process, in which timeout period is
   doubled upon each retransmission until either the node receives a
   Binding Acknowledgement or the timeout period reaches the value
   MAX_BINDACK_TIMEOUT.


8.7. Rate Limiting for Sending Binding Updates

   A mobile node MUST NOT send Binding Updates more often than once per
   MAX_UPDATE_RATE seconds to any correspondent node.  After sending 5
   consecutive Binding Updates to a particular correspondent node with
   the same care-of address, the mobile node SHOULD reduce its rate
   of sending Binding Updates to that correspondent node, to the rate
   of SLOW_UPDATE_RATE per second.  The mobile node MAY continue to
   send Binding Updates at the slower rate indefinitely, in hopes that
   the correspondent node will eventually be able to process a Binding
   Update and begin to route its packets directly to the mobile node at
   its new care-of address.


8.8. Receiving Binding Acknowledgements

   Upon receiving a packet carrying a Binding Acknowledgement, a mobile
   node MUST validate the packet according to the following tests:

    -  The packet contains an IP Authentication header and the
       authentication is valid [1].  The Authentication header is
       assumed to provide both authentication and integrity protection.

    -  The Option Length field in the option is greater than or equal to
       8 octets.

    -  The Identification field is valid.

   Any Binding Acknowledgement not satisfying all of these tests MUST be
   silently ignored, although the remainder of the packet (i.e., other
   options, extension headers, or payload) SHOULD be processed normally
   according to any procedure defined for that part of the packet.

   When a mobile node receives a packet carrying a valid Binding
   Acknowledgement, the mobile node MUST examine the Status field as
   follows:

    -  If the Status field indicates that the Binding Update was
       accepted (the Status field is less than 128), then the mobile
       node MUST update the corresponding entry in its Binding Update




Johnson and Perkins            Expires 26 May 1997             [Page 38]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


       List to indicate that the Binding Update has been acknowledged.
       The mobile node MUST thus stop retransmitting the Binding Update.

    -  If the Status field indicates that the Binding Update was not
       accepted (the Status field is greater than or equal to 128), then
       the mobile node MUST delete the corresponding Binding Update List
       entry.  Optionally, the mobile node MAY take steps to correct the
       cause of the error and retransmit the Binding Update, subject to
       the rate limiting restriction specified in Section 8.7.


8.9. Using Multiple Care-of Addresses

   As described in Section 8.2, a mobile node MAY have more than
   one care-of address at a time.  Particularly in the case of many
   wireless networks, a mobile node effectively may be reachable
   through multiple link-level points of attachment at the same time
   (e.g., with overlapping wireless cells), on which different on-link
   network prefixes may exist.  A mobile node SHOULD select a primary
   care-of address from among those care-of addresses it has formed
   using any of these network prefixes, based on the movement detection
   mechanism in use (Section 8.1).  When the mobile node selects a new
   primary care-of address, it MUST register it with its home agent
   through a Binding Update message with the Home Registration (H) and
   Acknowledge (A) bits set, as described in Section 8.3.

   To assist with smooth handoffs, a mobile node SHOULD retain
   its previous primary care-of address as a (non-primary) care-of
   address, and SHOULD still accept packets at this address, even after
   registering its new primary care-of address with its home agent.
   This is reasonable, since the mobile node could only receive packets
   at its previous primary care-of address if it were indeed still
   connected to that link.  If the previous primary care-of address
   was allocated using stateful address autoconfiguration [3], the
   mobile node may not wish to release the address immediately upon
   switching to a new primary care-of address.  The stateful address
   autoconfiguration server will allow mobile nodes to acquire new
   addresses while still using previously allocated addresses.


8.10. Returning Home

   A mobile node detects that it has returned to its home subnet through
   the movement detection algorithm in use (Section 8.1), when the
   mobile node detects that the network prefix of its home subnet is
   again on-link.  The mobile node SHOULD then send a Binding Update to
   its home agent, to instruct its home agent to no longer intercept
   or tunnel packets for it.  In this Binding Update, the mobile node



Johnson and Perkins            Expires 26 May 1997             [Page 39]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   MUST set the Care-of Address field to its own IPv6 home address.  As
   with other Binding Updates sent to register with its home agent, the
   mobile node MUST set the Acknowledge (A) and Home Registration (H)
   bits, and SHOULD retransmit the Binding Update until a matching
   Binding Acknowledgement message is received.

   In addition, the mobile node MUST multicast onto the home subnet
   (to the all-nodes multicast address) a Neighbor Advertisement
   message [8], to advertise its link-layer address for its own IPv6
   home address.  The Target Address in this Neighbor Advertisement
   message MUST be set to the mobile node's home address, and the
   Advertisement MUST include a Target Link-layer Address option
   specifying the mobile node's link-layer address.  Similarly, the
   mobile node MUST multicast a Neighbor Advertisement message to
   advertise its link-layer address for its IPv6 link-local address.
   The Solicited Flag (S) in these Advertisements MUST NOT be set, since
   they were not solicited by any Neighbor Solicitation message.  The
   Override Flag (O) in these Advertisements MUST be set, indicating
   that the Advertisements SHOULD override any existing Neighbor Cache
   entries at any node receiving them.

   Since multicasts on the local link (such as Ethernet) are typically
   not guaranteed to be reliable, the mobile node MAY retransmit
   these Neighbor Advertisement messages up to MAX_ADVERT_REXMIT times
   to increase their reliability.  It is still possible that some
   nodes on the home subnet will not receive any of these Neighbor
   Advertisements, but these nodes will eventually be able to recover
   through use of Neighbor Unreachability Detection [8].























Johnson and Perkins            Expires 26 May 1997             [Page 40]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


9. Routing Multicast Packets

   A mobile node that is connected to its home subnet functions in the
   same way as any other (stationary) node.  Thus, when it is at home,
   a mobile node functions identically to other multicast senders and
   receivers.  This section therefore describes the behavior of a mobile
   node that is not on its home subnet.

   In order receive packets sent to some multicast group, a mobile node
   must join the that multicast group.  One method by which a mobile
   node MAY join the group is via a (local) multicast router on the
   foreign subnet being visited.  This option assumes that there is a
   multicast router present on the foreign subnet.  The mobile node
   SHOULD use its care-of address sharing a network prefix with the
   multicast router, as the source IPv6 address of its multicast group
   membership control message packets.

   Alternatively, a mobile node MAY join multicast groups via a
   bi-directional tunnel to its home agent, assuming that its home agent
   is a multicast router.  The mobile node tunnels the appropriate
   multicast group membership control packets to its home agent, and the
   home agent forwards multicast packets down the tunnel to the mobile
   node.  The home agent MUST tunnel the packet directly to the mobile
   node's primary care-of address.

   A mobile node that wishes to send packets to a multicast group
   also has two options:  (1) send directly on the foreign subnet
   being visited; or (2) send via a tunnel to its home agent.  Because
   multicast routing in general depends upon the Source Address used
   in the IP header of the multicast packet, a mobile node that sends
   multicast packets directly on the foreign subnet MUST use its
   care-of address as the IPv6 Source Address of each multicast packet.
   Similarly, a mobile node that tunnels a multicast packet to its home
   agent MUST use its home address as the IPv6 Source Address of both
   the (inner) multicast packet and the (outer) encapsulating packet.
   This second option assumes that the home agent is a multicast router.















Johnson and Perkins            Expires 26 May 1997             [Page 41]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


10. Constants

      INITIAL_BINDACK_TIMEOUT   1 second

      MAX_BINDACK_TIMEOUT       256 seconds

      MAX_UPDATE_RATE           once per second

      SLOW_UPDATE_RATE          once per 10 seconds

      MAX_ADVERT_REXMIT         3








































Johnson and Perkins            Expires 26 May 1997             [Page 42]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


11. Security Considerations

   The Binding Update option described in this document will result
   in packets addressed to a mobile node being delivered instead to
   its care-of address.  This ability to change the routing of these
   packets could be a significant vulnerability if any packet containing
   a Binding Update option was not authenticated.  Such use of "remote
   redirection", for instance as performed by the Binding Update option,
   is widely understood to be a security problem in the current Internet
   if not authenticated [2].

   The mobile computing environment is potentially very different from
   the ordinary computing environment.  In many cases, mobile computers
   will be connected to the network via wireless links.  Such links
   are particularly vulnerable to passive eavesdropping, active replay
   attacks, and other active attacks.

   Users who have sensitive data that they do not wish others to see
   should use mechanisms outside the scope of this document (such as
   encryption) to provide appropriate protection.  Users concerned about
   traffic analysis should consider appropriate use of link encryption.
   If absolute location privacy is desired, the mobile node can create a
   tunnel to its home agent.  Then, packets destined for correspondent
   nodes will appear to emanate from the home subnet, and it may be
   more difficult to pinpoint the location of the mobile node.  Such
   mechanisms are all beyond the scope of this document.

























Johnson and Perkins            Expires 26 May 1997             [Page 43]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


Acknowledgements

   We would like to thank the members of the Mobile IP and IPng Working
   Groups for their comments and suggestions on this draft.  We would
   particularly like to thank Thomas Narten and Erik Nordmark for
   their detailed reviews of earlier versions of this draft.  Their
   suggestions have helped to improve both the design and presentation
   of the protocol.











































Johnson and Perkins            Expires 26 May 1997             [Page 44]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


A. Open Issues

A.1. Session Keys with Local Routers

   In the IPv4 route optimization proposal [7], a mechanism is outlined
   whereby a session key can be established between foreign agents
   and mobile nodes, without requiring any pre-established security
   relationship between them.  A similar mechanism could be defined for
   IPv6, to avoid the need for a possibly time-consuming negotiation
   between routers and mobile nodes for the purpose of obtaining the
   session key, which under many circumstances would only be used once.
   This mechanism, if needed, can be specified completely outside
   the Mobile IPv6 protocol and would amount to a way of creating a
   dynamic security association between two nodes which do not share an
   existing trust relationship, but which need to agree on a key for
   some particular purpose (here, allowing the future authentication of
   a Binding Update).  Hopefully, the work of the IP Security Working
   Group will allow this function to be performed appropriately for
   mobile nodes, say by a Diffie-Hellman key exchange.


A.2. Source Address Filtering by Firewalls

   The current specification does nothing to permit mobile nodes to
   send their packets through firewalls which filter out packets with
   the "wrong" source IPv6 addresses in the IPv6 packet header.  The
   mobile node's home address may be unlikely to fall within the ranges
   required to satisfy the firewall's criteria for further delivery.

   As indicated by recent discussion, firewalls are unlikely to
   disappear.  Any standardized solution [13] to the firewall problem
   based on hiding the non-local source address outside the source
   address field of the IP header is likely to fail.  Any vendor or
   facilities administrator wanting to filter based on the address in
   the IPv6 source address field would also quickly begin filtering on
   hidden source addresses.

   Assume, for the moment, that a mobile node is able to establish a
   secure tunnel through a firewall protecting the domain in which
   a correspondent node is located.  The mobile node could then
   encapsulate its packet so that the outer IP header was addressed
   to the firewall and used the mobile node's care-of address as the
   source address.  When the firewall decapsulates, it would be able to
   authenticate the inner packet based (correctly) on the mobile node's
   home address.  After the authentication is performed, the firewall
   could forward the packet to the correspondent node as desired.  This
   simple procedure has the feature that it requires the minimal amount
   of encapsulation, no assistance by routers or other agents, and that



Johnson and Perkins            Expires 26 May 1997             [Page 45]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   the firewall can establish a security relationship with the mobile
   node based on its home (i.e., permanent) address.


A.3. Dynamic Home Agent Address Discovery

   It is useful for a mobile node to be able to send a Binding Update
   its home agent without explicitly knowing the home agent's address.
   For example, since the mobile node was last at home, it may have
   become necessary to replace the node serving as its home agent due
   to the failure of the original node or due to reconfiguration of the
   home subnet.  It thus may not always be possible or convenient for a
   mobile node to know the exact address of its own home agent.  Several
   methods of allowing a mobile node to dynamically discover the address
   of a router in its home subnet are currently under consideration.


A.4. Replay Protection for Binding Updates

   Some transforms for use in conjunction with the IP Authentication
   Header [1] provide support for replay protection [9, 6].  Ideally,
   such transforms would directly support the needs of Mobile IPv6
   for providing replay protection for Binding Updates and Binding
   Acknowledgements.  However, this does not currently appear to be
   the case.  These transforms provide optional support for accepting
   packets out of order, through use of an "out of order window" in the
   receiver, and it does not currently seem to be specified how the
   size (or presence) of such a window can be controlled.  For Binding
   Updates, it is important that any packets containing a Binding
   Update that arrive at the receiver do so strictly in the order sent
   (although some may harmlessly be dropped, as long as a later Binding
   Update does arrive).  Without control of the window at the receiver,
   this ordering requirement on Binding Update delivery cannot be
   supported directly by these transforms, although these transforms do
   use a sequence number to support their own replay protection.

   The Identification field in the Binding Update (and Binding
   Acknowledgement) is currently specified in this document for use
   in sequencing Binding Updates at the receiver, and in matching
   returned Binding Acknowledgements with outstanding Binding Updates
   at the sender.  The use of this field in this manner, together with
   the use of the current IP Authentication transforms that supports
   replay protection, seems to support the necessary replay protection
   requirements for Mobile IPv6, although it seems that the need for two
   sequence numbers in the packet (one for IP Authentication and one for
   Mobile IPv6) could be simplified.





Johnson and Perkins            Expires 26 May 1997             [Page 46]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


References

    [1] Randall Atkinson.  IP Authentication header.  RFC 1826, August
        1995.

    [2] S. M. Bellovin.  Security problems in the TCP/IP protocol suite.
        ACM Computer Communications Review, 19(2), March 1989.

    [3] Jim Bound and Charles Perkins.  Dynamic Host Configuration
        Protocol for IPv6 (DHCPv6).  Internet-Draft,
        draft-ietf-dhc-dhcpv6-07.txt, August 1996.  Work in progress.

    [4] Alex Conta and Stephen Deering.  Generic packet
        tunneling in IPv6 specification.  Internet-Draft,
        draft-ietf-ipngwg-ipv6-tunnel-02.txt, June 1996.  Work
        in progress.

    [5] Stephen E. Deering and Robert M. Hinden.  Internet Protocol
        version 6 (IPv6) specification.  RFC 1883, December 1995.

    [6] Shu jen Chang and Robert Glenn.  HMAC-SHA IP authentication with
        replay prevention.  Internet-Draft,
        draft-ietf-ipsec-ah-hmac-sha-04.txt, November 1996.  Work in
        progress.

    [7] David B. Johnson and Charles Perkins.  Route optimization in
        Mobile IP.  Internet-Draft, draft-ietf-mobileip-optim-04.txt,
        February 1996.  Work in progress.

    [8] Thomas Narten, Erik Nordmark, and William Allen Simpson.
        Neighbor Discovery for IP version 6 (IPv6).  RFC 1970, August
        1996.

    [9] Michael J. Oehler and Robert Glenn.  HMAC-MD5 IP
        authentication with replay prevention.  Internet-Draft,
        draft-ietf-ipsec-ah-hmac-md5-04.txt, November 1996.  Work in
        progress.

   [10] J. B. Postel.  User Datagram Protocol.  RFC 768, August 1980.

   [11] J. B. Postel, editor.  Transmission Control Protocol.  RFC 793,
        September 1981.

   [12] Joyce K. Reynolds and Jon Postel.  Assigned numbers.  RFC 1700,
        October 1994.






Johnson and Perkins            Expires 26 May 1997             [Page 47]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


   [13] Fumio Teraoka.  Mobility support in IPv6.  Internet-Draft,
        draft-teraoka-ipv6-mobility-sup-03.txt, April 1996.  Work in
        progress.

   [14] Susan Thomson and Thomas Narten.  IPv6 stateless address
        autoconfiguration.  RFC 1971, August 1996.













































Johnson and Perkins            Expires 26 May 1997             [Page 48]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


Chair's Address

   The Working Group can be contacted via its current chairs:

        Jim Solomon
        Motorola, Inc.
        1301 E. Algonquin Rd.
        Schaumburg, IL  60196
        USA

        Phone:  +1 847 576-2753
        E-mail: solomon@comm.mot.com


        Erik Nordmark
        Sun Microsystems, Inc.
        2550 Garcia Avenue
        Mt. View, CA  94041
        USA

        Phone:  +1 415 786-5166
        Fax:    +1 415 786-5896
        E-mail: nordmark@sun.com




























Johnson and Perkins            Expires 26 May 1997             [Page 49]

INTERNET-DRAFT         Mobility Support in IPv6         26 November 1996


Authors' Addresses

   Questions about this document can also be directed to the authors:

        David B. Johnson
        Carnegie Mellon University
        Computer Science Department
        5000 Forbes Avenue
        Pittsburgh, PA  15213-3891
        USA

        Phone:  +1 412 268-7399
        Fax:    +1 412 268-5576
        E-mail: dbj@cs.cmu.edu


        Charles Perkins
        IBM Corporation
        T. J. Watson Research Center
        Room H3-D34
        30 Saw Mill River Rd.
        Hawthorne, NY  10532
        USA

        Phone:  +1 914 789-7350
        Fax:    +1 914 784-6205
        E-mail: perk@watson.ibm.com
























Johnson and Perkins            Expires 26 May 1997             [Page 50]

